Repository: EricRamirezS/SAPUtils
Catalog: SAPUtils/__Internal/I18N/Texts.*.resx
Languages: de, es, fr, it, pt_br, ru

# SapAddon_GenerateSetupFiles_Files_Generated
source: Files generated: {0} {1}
de: Erstellte Dateien: {0} {1}
es: Archivos generados: {0} {1}
fr: Fichiers générés : {0} {1}
it: File generati: {0} {1}
pt_br: Arquivos gerados: {0} {1}
ru: Сгенерированные файлы: {0} {1}

# SapAddon_Run_Finishing_add_on_initialization
source: Finishing add-on initialization
de: Add-on-Initialisierung beenden
es: Finalizada la inicialización del add-on
fr: Fin de l'initialisation du module
it: Completamento inizializzazione aggiuntiva
pt_br: Finalizando inicialização do complemento
ru: Завершение инициализации дополнения

# SapAddon_Run_Running_SAP_Add_on
source: Running SAP Add-on
de: SAP-Add-on wird ausgeführt
es: Ejecutando add-on SAP
fr: Exécution du module SAP
it: Componente Aggiuntivo SAP
pt_br: Complemento SAP em execução
ru: Запуск SAP дополнения

# SapAddon_SapAddon_SAP_Add_on_Initialized
source: SAP Add-on Initialized
de: SAP-Add-on initialisiert
es: Inicializado add-on SAP
fr: Add-on SAP initialisé
it: SAP Add-on Inizializzato
pt_br: Complemento SAP Inicializado
ru: Инициализация дополнения SAP

# SapAddon_SapAddon_Add_on_could_not_be_initialized
source: Add-on could not be initialized
de: Add-on konnte nicht initialisiert werden
es: El add-on no pudo inicializarse
fr: Le module n'a pas pu être initialisé
it: Il componente aggiuntivo non può essere inizializzato
pt_br: Complemento não pôde ser inicializado
ru: Дополнение не может быть инициализировано

source: No .csproj file was found in the executable path or parent folders
de: Keine .csproj-Datei im ausführbaren Pfad oder übergeordneten Ordner gefunden
es: No se ha encontrado ningún archivo .csproj en la ruta ejecutable o en las carpetas contenedoras
fr: Aucun fichier .csproj n'a été trouvé dans le chemin de l'exécutable ou dans les dossiers parents
it: Nessun file .csproj è stato trovato nel percorso eseguibile o nelle cartelle genitore
pt_br: Nenhum arquivo .csproj foi encontrado no caminho do executável ou nas pastas pai
ru: Файл .csproj не найден в файле исполняемого файла или родительской папке

# SapAddon_CreateMenu_Loading_Menus
source: Loading Menus
de: Lade Menüs
es: Cargando Menús
fr: Chargement des menus
it: Caricamento Menù
pt_br: Carregando menus
ru: Загрузка меню

# SapAddon_CreateMenu_Creating_BoCreatableObjectType_cot_MenuCreationParams
source: Creating BoCreatableObjectType.cot_MenuCreationParams
de: BoCreatableObjectType.cot_MenuCreationParams erstellen
es: Creando BoCreatableObjectType.cot_MenuCreationParams
fr: Création de BoCreatableObjectType.cot_MenuCreationParams
it: Creazione BoCreatableObjectType.cot_MenuCreationParams
pt_br: Criando BoatableObjectType.cot_MenuCreationParams
ru: Создание BoCreatableObjectType.cot_MenuCreationParams

# SapAddon_CreateMenu_Getting_Menu_Item_by_id__0_
source: Getting Menu Item by id {0}
de: Lade Menüeintrag über id {0}
es: Obteniendo elemento de menú por el id {0}
fr: Récupération de l'élément de menu par l'id {0}
it: Ottenere l'elemento di menu per id {0}
pt_br: Obtendo item de menu por ajuda {0}
ru: Получение элемента меню по id {0}

source: Setting new Menus ItemPosition to last index if no position is set
de: Setze neue Menü-Eintragsposition auf den letzten Index, wenn keine Position gesetzt ist
es: Establecer nuevo elemento de menús al último índice si no se ha establecido ninguna posición
fr: Réglage de la nouvelle Menus ItemPosition sur le dernier index si aucune position n'est définie
it: Impostazione nuova posizione elemento menu all'ultimo indice se nessuna posizione è impostata
pt_br: Configurando nova Posição do Item de Menus para último índice se nenhuma posição for definida
ru: Установка позиции нового пункта меню на последний индекс, если не задана позиция

# SapAddon_CreateMenu_Subscribing_to_Application_MenuEvent
source: Subscribing to Application.MenuEvent
de: Abonnieren von Application.MenuEvent
es: Suscribiéndose a Aplicación.MenuEvent
fr: S'abonner à Application.MenuEvent
it: Iscrizione a Application.MenuEvent
pt_br: Inscrever-se no Application.MenuEvent
ru: Подписка на приложение.MenuEvent

# SapAddon_CreateMenu_The_new_menu_could_not_be_created__Error__
source: The new menu could not be created. Error:
de: Das neue Menü konnte nicht erstellt werden. Fehler:
es: El nuevo menú no pudo ser creado. Error:
fr: Le nouveau menu n'a pas pu être créé. Erreur:
it: Impossibile creare il nuovo menu. Errore:
pt_br: O novo menu não pôde ser criado:
ru: Новое меню не может быть создано. Ошибка:

# SapAddon_CreateMenu_The_new_menu_could_not_be_created__Error___0_
source: The new menu could not be created. Error: {0}
de: Das neue Menü konnte nicht erstellt werden. Fehler: {0}
es: El nuevo menú no pudo ser creado. Error: {0}
fr: Le nouveau menu n'a pas pu être créé. Erreur: {0}
it: Impossibile creare il nuovo menu. Errore: {0}
pt_br: O novo menu não pôde ser criado. Erro: {0}
ru: Новое меню не может быть создано. Ошибка: {0}

# SapAddon_AddMenuItems_Adding_menu_folder__0_
source: Adding menu folder {0}
de: Menüordner {0} hinzufügen
es: Añadiendo carpeta de menú {0}
fr: Ajout du dossier de menu {0}
it: Aggiunta cartella menù {0}
pt_br: Adicionando pasta de menu {0}
ru: Добавление папки меню {0}

# SapAddon_AddMenuItems_Adding_menu_folder__0__item
source: Adding menu folder {0} item
de: Menüordner {0} Element hinzufügen
es: Añadiendo el elemento de la carpeta de menú {0}
fr: Ajout du dossier de menu {0} élément
it: Aggiunta della cartella di menu {0}
pt_br: Adicionando pasta de menu {0} item
ru: Добавление папки меню {0} элемента

# SapAddon_AddMenuItems_Adding_menu_item__0_
source: Adding menu item {0}
de: Menüpunkt {0} hinzufügen
es: Añadiendo elemento de menú {0}
fr: Ajout de l'élément de menu {0}
it: Aggiunta voce di menu {0}
pt_br: Adicionando item de menu {0}
ru: Добавление пункта меню {0}

# SapAddon_AddMenuItem_Menu_item__0__is_Sap_Menu__skipping_
source: Menu item {0} is Sap Menu, skipping.
de: Menüpunkt {0} ist Sap Menü, übersprungen.
es: El elemento de menú {0} es Menú de sistema Sap, omitiendo.
fr: L'élément de menu {0} est le menu Sap, ignoré.
it: La voce di menu {0} è Menù Lappata, salta.
pt_br: Item de menu {0} é Sap Menu, ignorando.
ru: Пункт меню {0} это Sap меню, пропускается.

# SapAddon_AddMenuItem_Checking_if_menu_item__0__exists
source: Checking if menu item {0} exists
de: Überprüfe, ob der Menüpunkt {0} existiert
es: Comprobando si el elemento de menú {0} existe
fr: Vérification si l'élément de menu {0} existe
it: Controllo se la voce di menu {0} esiste
pt_br: Verificando se o item de menu {0} existe
ru: Проверяет, существует ли пункт меню {0}

# SapAddon_AddMenuItem_Removing_menu_item__0_
source: Removing menu item {0}
de: Entferne Menüpunkt {0}
es: Eliminando elemento de menú {0}
fr: Suppression de l'élément de menu {0}
it: Rimozione voce di menu {0}
pt_br: Removendo item de menu {0}
ru: Удаление пункта меню {0}

# SapAddon_AddMenuItem_Setting_menu_item__0__s_image
source: Setting menu item {0}'s image
de: Setze Menüpunkt {0}Bild
es: Configurando imagen del elemento de menú {0}
fr: Paramétrage de l'image de l'élément de menu {0}
it: Impostazione immagine di menu {0}
pt_br: Configurando imagem do item de menu {0}
ru: Установка изображения пункта меню {0}

source: SBO_Application_MenuEvent called with pval.MenuUID {0}
de: SBO_Application_MenuEvent mit pval.MenuUID {0} aufgerufen
es: SBO_Application_MenuEvent llamado con pval.MenuUID {0}
fr: SBO_Application_MenuEvent appelé avec pval.MenuUID {0}
it: SBO_Application_MenuEvent chiamato con pval.MenuUID {0}
pt_br: SBO_Application_MenuEvent chamado com pval.MenuUID {0}
ru: SBO_Application_MenuEvent вызван с помощью pval.MenuUID {0}

# SapAddon_SBO_Application_MenuEvent_Invoke__0__related_method
source: Invoke {0} related method
de: {0} verwandte Methode aufrufen
es: Invocando método relacionado con menú {0}
fr: Invoquer la méthode liée à {0}
it: Invoca il metodo relativo {0}
pt_br: Invocar método relacionado a {0}
ru: Вызвать метод {0}

# SapAddon_InitializeUserTables_Processing_table___0_
source: Processing table: {0}
de: Verarbeite Tabelle: {0}
es: Procesando tabla: {0}
fr: Table de traitement : {0}
it: Tabella di elaborazione: {0}
pt_br: Tabela de processamento: {0}
ru: Обработка таблицы: {0}

# SapAddon_InitializeUserTables_Creating_user_table___0_
source: Creating user table: {0}
de: Benutzertabelle wird erstellt: {0}
es: Creando tabla de usuario: {0}
fr: Création de la table utilisateur : {0}
it: Creazione tabella utente: {0}
pt_br: Criando tabela de usuário: {0}
ru: Создание таблицы пользователя: {0}

# SapAddon_InitializeUserTables_Processing_field___0___1_
source: Processing field: {0}.{1}
de: Verarbeite Feld: {0}.{1}
es: Procesando campo: {0}.{1}
fr: Champ de traitement : {0}.{1}
it: Campo di elaborazione: {0}.{1}
pt_br: Processando campo: {0}.{1}
ru: Обработка поля: {0}.{1}

source: Cannot create DateTimeFieldAttribute Field in System Table, use Date and Time instead.
de: DatumTimeFieldAttributfeld kann in der Systemtabelle nicht erstellt werden. Verwenden Sie stattdessen Datum und Zeit.
es: No se puede crear el campo DateTimeFieldAttribute en la tabla del sistema, utilice en su lugar fecha y hora.
fr: Impossible de créer le champ DateTimeFieldAttribute dans la table système, utilisez la date et l'heure à la place.
it: Impossibile creare il campo DateTimeFieldAttribute nella tabella di sistema, utilizza invece Data e ora.
pt_br: Não é possível criar Campo de DataTimeFieldAtributo na Mesa de Sistema, use Data e Hora em vez disso.
ru: Не удается создать поле атрибута DateTimeFieldAttribute в системной таблице, используйте дату и время.

# SapAddon_CreateUserTable_Verifying_if_table__0__already_exist
source: Verifying if table {0} already exist
de: Überprüft, ob die Tabelle {0} bereits existiert
es: Verificando si la tabla {0} ya existe
fr: Vérification si la table {0} existe déjà
it: Verifica se la tabella {0} esiste già
pt_br: Verificando se a tabela {0} já existe
ru: Проверка уже существует ли таблица {0}

# SapAddon_CreateUserTable_Table__0__already_exist
source: Table {0} already exist
de: Tabelle {0} existiert bereits
es: La tabla {0} ya existe
fr: La table {0} existe déjà
it: La tabella {0} esiste già
pt_br: A tabela {0} já existe
ru: Таблица {0} уже существует

# SapAddon_CreateUserTable_Table__0__created
source: Table {0} created
de: Tabelle {0} erstellt
es: Tabla {0} creada
fr: Table {0} créée
it: Tabella {0} creata
pt_br: Tabela {0} criada
ru: Таблица {0} создана

# SapAddon_CreateUserTable_Unable_to_add_user_table__0___Error__1_
source: Unable to add user table {0}. Error {1}
de: Konnte die Benutzertabelle {0}nicht hinzufügen. Fehler {1}
es: No se puede agregar la tabla de usuario {0}. Error {1}
fr: Impossible d'ajouter la table utilisateur {0}. Erreur {1}
it: Impossibile aggiungere la tabella utente {0}. Errore {1}
pt_br: Não foi possível adicionar tabela de usuário {0}. Erro {1}
ru: Не удается добавить пользовательскую таблицу {0}. Ошибка {1}

# SapAddon_CreateUserTableField_Field__0___1__already_exist
source: Field {0}.{1} already exist
de: Feld {0}.{1} existiert bereits
es: El campo {0}.{1} ya existe
fr: Champ {0}.{1} existe déjà
it: Il campo {0}.{1} esiste già
pt_br: Campo {0}.{1} já existe
ru: Поле {0}.{1} уже существует

# SapAddon_CreateUserTableField_Field__0___1__created
source: Field {0}.{1} created
de: Feld {0}.{1} erstellt
es: Campo {0}.{1} creado
fr: Champ {0}.{1} créé
it: Campo {0}.{1} creato
pt_br: Campo {0}.{1} criado
ru: Поле {0}.{1} создано

# SapAddon_CreateUserTableField_Unable_to_add_field__0__to_table__1___Error__2_
source: Unable to add field {0} to table {1}. Error {2}
de: Konnte das Feld {0} nicht zur Tabelle {1}hinzufügen. Fehler {2}
es: No se puede agregar el campo {0} a la tabla {1}. Error {2}
fr: Impossible d'ajouter le champ {0} à la table {1}. Erreur {2}
it: Impossibile aggiungere il campo {0} alla tabella {1}. Errore {2}
pt_br: Não foi possível adicionar o campo {0} à tabela {1}. Erro {2}
ru: Невозможно добавить поле {0} в таблицу {1}. Ошибка {2}

# SapAddon_ExistTableField_Verifying_if_field__0___1__already_exist
source: Verifying if field {0}.{1} already exist
de: Überprüft, ob das Feld {0}bereits vorhanden ist.{1}
es: Verificando si el campo {0}.{1} ya existe
fr: Vérification du champ {0}.{1} existe déjà
it: Verifica se il campo {0}.{1} esiste già
pt_br: Verificando se o campo {0}.{1} já existe
ru: Проверка если поле {0}.{1} уже существует

# SapAddon_ValidateTable_Verifying_table__0__implements_UserTableObjectModel
source: Verifying table {0} implements UserTableObjectModel
de: Überprüft Tabelle {0} implementiert UserTableObjectModel
es: Verificación de tabla {0} implementa UserTableObjectModel
fr: Vérification de la table {0} implémente UserTableObjectModel
it: Verifica della tabella {0} implementa UserTableObjectModel
pt_br: Verificando a tabela {0} tem o atributo UserTableAttribute
ru: Верификация таблицы {0} реализует UserTableObjectModel

# SapAddon_ValidateTable__0__is_not_assignable_From_IUserTableObjectModel
source: {0} is not assignable From IUserTableObjectModel
de: {0} ist vom IUserTableObjectModel nicht zuweisbar
es: {0} no se puede asignar desde IUserTableObjectModel
fr: {0} n'est pas assignable depuis IUserTableObjectModel
it: {0} non è assegnabile da IUserTableObjectModel
pt_br: {0} não pode ser atribuído de IUserTableObjectModel
ru: {0} не назначается из IUserTableObjectModel

# SapAddon_ValidateTable_Veryfing_table__0__has_Attribute_UserTableAttribute
source: Verifying if table {0} has Attribute UserTableAttribute
de: Überprüfen der Tabelle {0}, ob das Attribut „UserTableAttribute“ vorhanden ist
es: Verificando si la tabla {0} tiene el atributo UserTable Attribute
fr: Vérification que la table {0} possède l'attribut UserTableAttribute
it: Verifica che la tabella {0} abbia l'attributo UserTableAttribute
pt_br: A tabela de Veryfing {0} tem Atributo UserTableAtributo
ru: Верификация таблицы {0} имеет атрибут UserTableAttribute

# SapAddon_ValidateTable_UserTable_Attribute_not_found_in_class__0_
source: UserTable Attribute not found in class {0}
de: BenutzerTable Attribut nicht gefunden in Klasse {0}
es: Atributo UserTable no encontrado en la clase {0}
fr: Attribut de table utilisateur introuvable dans la classe {0}
it: Attributo Tabella utente non trovato nella classe {0}
pt_br: Atributo UserTable não encontrado na classe {0}
ru: Атрибут UserTable не найден в классе {0}

# SapAddon_ValidateFields__0__Property__1__Marked_as_Ignored
source: {0} property `{1}` markes as Ignored
de: {0} Eigenschaft `{1}` Markierungen als ignoriert
es: El campo `{1}` de {0} marcado como ignoradao
fr: La propriété {0} `{1}` marque comme ignorée
it: {0} proprietà `{1}` marchi come ignorati
pt_br: A propriedade {0} `{1}marca como ignorada
ru: Свойство {0} `{1}` отмечено как игнорируемое

# SapAddon_ValidateFields_IUserTableField_not_found_in__0___1_
source: IUserTableField not found in {0}.{1}
de: IUserTableField nicht gefunden in {0}.{1}
es: IUserTableField no encontrado en {0}.{1}
fr: IUserTableField introuvable dans {0}.{1}
it: IUserTableField non trovato in {0}.{1}
pt_br: Campo IUserTableField não encontrado em {0}.{1}
ru: IUserTableField не найден в {0}.{1}

source: IUserTableField {0}.{1} is not valid. Expected property type: {2}, but got: {3}
de: IUserTableField {0}.{1} ist nicht gültig. Erwarteter Objekttyp: {2}, aber erhalten: {3}
es: IUserTableField {0}.{1} no es válido. Tipo de propiedad esperado: {2}, pero obtenido: {3}
fr: IUserTableField {0}.{1} n'est pas valide. Type de propriété attendu : {2}, mais obtenu : {3}
it: IUserTableField {0}.{1} non è valido. Tipo di proprietà previsto: {2}, ma ottenuto: {3}
pt_br: O campo IUserTableField {0}.{1} não é válido. Tipo de propriedade esperada: {2}, mas tem: {3}
ru: IUserTableField {0}.{1} недействителен. Ожидаемый тип свойства: {2}, но получен: {3}

# StatusExtensions_GetReadableName_Normal
source: ✅ Normal
it: ✅ Normale
ru: ✅ Обычный

# StatusExtensions_GetReadableName_Modify
source: ✏️ Modify
de: :Bleistift: Ändern
es: ✏️ Modificar
fr: ✏️ Modifier
it: ✏️ Modificare
pt_br: ✏️ Modificar
ru: ✏️ Изменить

# StatusExtensions_GetReadableName_Restore
source: 🔁 Restore
de: 🔁 Wiederherstellen
es: 🔁 Restaurar
fr: 🔁 Restaurer
it: 🔁 Ripristina
pt_br: 🔁 Restaurar
ru: :repeat_кнопка: Восстановить

# StatusExtensions_GetReadableName_New
source: ➕ New
de: ➕ Neu
es: ➕ Nuevo
fr: :+ : Nouveau
it: ➕ Nuovo
pt_br: ➕ Novo
ru: ➕ Новый

# StatusExtensions_GetReadableName_Discard
source: ❌ Discard
de: :Cross_mark: Verwerfen
es: ❌ Descartar
fr: ❌ Rejeter
it: ❌ Scarta
pt_br: ❌ Descartar
ru: ❌ Сбросить

# StatusExtensions_GetReadableName_Delete
source: 🗑️ Delete
de: 🗑️ Löschen
es: 🗑️ Eliminar
fr: 🗑️ Supprimer
it: 🗑️ Elimina
pt_br: 🗑️ Excluir
ru: 🗑️ Удалить

# MatrixExtensions_CflSubscriber_Error_applying_CFL_on_matrix___0_
source: Error applying CFL on matrix: {0}
de: Fehler beim Anwenden von CFL auf Matrix: {0}
es: Error al aplicar CFL a la matrix: {0}
fr: Erreur lors de l'application du CFL sur la matrice : {0}
it: Errore nell'applicare CFL a matrice: {0}
pt_br: Erro ao aplicar CFL na matriz: {0}
ru: Ошибка применения CFL в матрице: {0}

# AuditableField_GetUserTableField_Active
source: Active
de: Aktiv
es: Activo
fr: Actif
it: Attivo
pt_br: ativo
ru: Активный

# AuditableField_GetUserTableField_Inactive
source: Inactive
de: Inaktiv
es: Inactivo
fr: Inactif
it: Inattivo
pt_br: Inativo
ru: Неактивный

# AuditableField_GetUserTableField_Created_at_date
source: Created at date
de: Erstellt am Datum
es: Fecha creación
fr: Créé à la date
it: Creato alla data
pt_br: Data de criação
ru: Создано на дату

# AuditableField_GetUserTableField_Created_at_time
source: Created at time
de: Zur Zeit erstellt
es: Hora de creación
fr: Créé à l'heure
it: Creato al momento
pt_br: Criado no horário
ru: Создано

# AuditableField_GetUserTableField_Updated_at_date
source: Updated at date
de: Aktualisiert am Datum
es: Fecha actualización
fr: Mis à jour à la date
it: Aggiornato alla data
pt_br: Atualizado na data
ru: Обновлено на дату

# AuditableField_GetUserTableField_Updated_at_time
source: Updated at time
de: Aktualisiert
es: Hora de actualización
fr: Mis à jour à l'heure
it: Aggiornato al momento
pt_br: Atualizado na hora
ru: Обновлено вовремя

# AuditableField_GetUserTableField_Created_by
source: Created by
de: Erstellt von
es: Creado por
fr: Créé par
it: Creato da
pt_br: Criado Por
ru: Создано

# AuditableField_GetUserTableField_Updated_by
source: Updated by
de: Aktualisiert von
es: Actualizado por
fr: Mis à jour par
it: Aggiornato da
pt_br: Atualizado por
ru: Обновлено

# AuditableField_GetUserTableField__0__is_not_supported_in_IAuditable
source: {0} is not supported in IAuditable
de: {0} wird nicht in IAuditable unterstützt
es: {0} no está soportado en IAuditale
fr: {0} n'est pas pris en charge dans IAuditable
it: {0} non è supportato in IAuditable
pt_br: {0} não é suportado no IAuditable
ru: {0} не поддерживается в IAuditable

# FormatInfo_GetDateFullFormat_Unrecognized_date_format_
source: Unrecognized date format.
de: Unbekanntes Datumsformat.
es: Formato de fecha no reconocido.
fr: Format de date non reconnu.
it: Formato data non riconosciuto.
pt_br: Formato de data não reconhecido.
ru: Неизвестный формат даты.

source: Valid values must be provided in (value, description) pairs.
de: Gültige Werte müssen in (Wert, Beschreibung) Paaren angegeben werden.
es: Los valores válidos deben ser proporcionados en pares (valor, descripción).
fr: Les valeurs valides doivent être fournies par paires (valeur, description).
it: I valori validi devono essere forniti in (valore, descrizione) coppie.
pt_br: Valores válidos devem ser fornecidos em pares (valor, descrição).
ru: Допустимые значения должны быть указаны в парах (значения, описания).

source: UserTableObjectModel.GetAll Method not found
de: UserTableObjectModel.GetAll-Methode nicht gefunden
es: Método UserTableObjectModel.GetAll no encontrado
fr: UserTableObjectModel.GetAll Méthode introuvable
it: UserTableObjectModel.GetAll Metodo non trovato
pt_br: Método não encontrado
ru: UserTableObjectModel.GetAll метод не найден

# SqlWhereBuilder_BuildGroup_Unsupported_comparison___0_
source: Unsupported comparison: {0}
de: Nicht unterstützter Vergleich: {0}
es: Comparación no soportada: {0}
fr: Comparaison non prise en charge : {0}
it: Confronto non supportato: {0}
pt_br: Comparação não suportada: {0}
ru: Неподдерживаемое сравнение: {0}

# ConsoleLogger_PrintExceptionToConsole_Caused_by__
source: Caused by:
de: Ausgelöst von:
es: Causado por:
fr: Motivé par:
it: Causato da:
pt_br: Causado por:
ru: Причина:

# ConsoleLogger_PrintExceptionToConsole_Occurred_in___0___1_
source: Occurred in: {0}.{1}
de: Aufgetreten in: {0}.{1}
es: Ocurrió en: {0}.{1}
fr: Il s'est produit dans : {0}.{1}
it: Si è verificato in: {0}.{1}
pt_br: Ocorreu em: {0}.{1}
ru: Произошло в: {0}.{1}

# ConsoleLogger_PrintExceptionToConsole_File___0_
source: File: {0}
de: Datei: {0}
es: Archivo: {0}
fr: Fichier : {0}
pt_br: Arquivo: {0}
ru: Файл: {0}

# ConsoleLogger_PrintExceptionToConsole_Line___0_
source: Line: {0}
de: Zeile: {0}
es: Línea: {0}
fr: Ligne: {0}
it: Linea: {0}
pt_br: Linha: {0}
ru: Строка: {0}

# ConsoleLogger_PrintExceptionToConsole_Stack_Trace_
source: Stack Trace:
fr: Trace de pile:
it: Traccia Stack:
pt_br: Rastreamento da Pilha
ru: Трассировка стеков:

# Logger_Logger_JSON_error___0_
source: JSON error: {0}
de: JSON-Fehler: {0}
es: Error JSON: {0}
fr: Erreur JSON : {0}
it: Errore di JSON: {0}
pt_br: Erro de JSON: {0}
ru: Ошибка JSON: {0}

# Logger_ProcessLogQueue__Logger__Error_writing_log___0_
source: [Logger] Error writing log: {0}
de: [Logger] Fehler beim Schreiben des Logs: {0}
es: [Logger] Error al escribir el registro: {0}
fr: [Logger] Erreur lors de l'écriture du journal : {0}
it: [Logger] Errore nello scrivere il registro: {0}
pt_br: [Logger] Erro ao escrever log: {0}
ru: [Logger] Ошибка записи журнала: {0}

# Logger_GetLogFilePath_The_path_contains_invalid_characters___fullPath_
source: The path contains invalid characters: {fullPath}
de: Der Pfad enthält ungültige Zeichen: {fullPath}
es: La ruta contiene caracteres no válidos: {fullPath}
fr: Le chemin contient des caractères invalides : {fullPath}
it: Il percorso contiene caratteri non validi: {fullPath}
pt_br: O caminho contém caracteres inválidos: {fullPath}
ru: Путь содержит недопустимые символы: {fullPath}

# Logger_GetLogFilePath_Company
source: Company
de: Firma
es: Empresa
fr: Entreprise
it: Società
pt_br: Empresas
ru: Компания

# Logger_GetLogFilePath_User
source: User
de: Benutzer
es: Usuario
fr: Utilisateur
it: Utente
pt_br: Usuário
ru: Пользователь

# Logger_Log__Not_serializable_to_XML___0___ToString_____1_
source: [Not serializable to XML] {0}. ToString(): {1}
de: [Nicht serialisierbar zu XML] {0}. ToString(): {1}
es: [No serializable a XML] {0}. ToString(): {1}
fr: [Non sérialisable en XML] {0}. ToString(): {1}
it: [Non serializzabile in XML] {0}. ToString(): {1}
pt_br: [Não serializável para XML] {0}. ToString(): {1}
ru: [Не подходит к XML] {0}. Строка(): {1}

# Logger_Log__Object___0___1__2_
source: [Object: {0}]{1}{2}
de: [Objekt: {0}]{1}{2}
es: [Objeto: {0}]{1}{2}
fr: [Objet : {0}]{1}{2}
it: [Oggetto: {0}]{1}{2}
pt_br: [Objeto: {0}]{1}{2}
ru: [Объект: {0}]{1}{2}

# Logger_ExceptionToString_Occurred_in___0___1_
source: Occurred in: {0}.{1}
de: Aufgetreten in: {0}.{1}
es: Ocurrió en: {0}.{1}
fr: Il s'est produit dans : {0}.{1}
it: Si è verificato in: {0}.{1}
pt_br: Ocorreu em: {0}.{1}
ru: Произошло в: {0}.{1}

# Logger_ExceptionToString_File___0_
source: File: {0}
de: Datei: {0}
es: Archivo: {0}
fr: Fichier : {0}
pt_br: Arquivo: {0}
ru: Файл: {0}

# Logger_ExceptionToString_Line___0_
source: Line: {0}
de: Zeile: {0}
es: Línea: {0}
fr: Ligne: {0}
it: Linea: {0}
pt_br: Linha: {0}
ru: Строка: {0}
