Repository: EricRamirezS/SAPUtils
Catalog: SAPUtils/__Internal/I18N/Texts.*.resx
Languages: de, es, fr, it, pt_br, ru

# Logger_ExceptionToString_Stack_Trace_
source: Stack Trace:
fr: Trace de pile:
it: Traccia Stack:
pt_br: Rastreamento da Pilha
ru: Трассировка стеков:

# Logger_ExceptionToString_Caused_by___0____1_
source: Caused by: {0}: {1}
de: Ausgelöst von: {0}: {1}
es: Causado por: {0}: {1}
fr: Cautionné par: {0}: {1}
it: Causato da: {0}: {1}
pt_br: Causado por: {0}: {1}
ru: Причина: {0}: {1}

# Logger_CleanOldLogs_Could_not_delete_file__0____1_
source: Could not delete file {0}: {1}
de: Konnte Datei {0}nicht löschen: {1}
es: No se pudo eliminar el archivo {0}: {1}
fr: Impossible de supprimer le fichier {0}: {1}
it: Impossibile eliminare il file {0}: {1}
pt_br: Não foi possível excluir o arquivo {0}: {1}
ru: Не удалось удалить файл {0}: {1}

# Logger_Format__0___ERROR_FORMATTING_ARGUMENTS____1_
source: {0} [ERROR FORMATTING ARGUMENTS]: {1}
de: {0} [FEHLER-FORMIERUNGS]: {1}
es: {0} [ERROR DE FORMATO DE ARGUMENTOS]: {1}
fr: {0} [ARGUMENTS DE FORMATT D'ERREURS] : {1}
it: {0} [ERROR FORMATTI ARGUMENTI]: {1}
pt_br: {0} [FERRO DE ARGUMENTE]: {1}
ru: {0} [ОШИБКА БРОНИРОВАНИЯ]: {1}

# Logger_Log__null
source: null
es: nulo
pt_br: nulo
ru: пустой

# Logger_Error_Unknown_error
source: Unknown error
de: Unbekannter Fehler
es: Error desconocido
fr: Erreur inconnue
it: Errore sconosciuto
pt_br: Erro desconhecido
ru: Неизвестная ошибка

# LogSettings_Instance_Error_saving_LogSettings_file___0_
source: Error saving LogSettings file: {0}
de: Fehler beim Speichern der LogEinstellungen: {0}
es: Error al guardar el archivo LogSettings: {0}
fr: Erreur lors de la sauvegarde du fichier des paramètres de log: {0}
it: Errore nel salvare il file di LogImpostazioni: {0}
pt_br: Erro ao salvar arquivo de configurações de log: {0}
ru: Ошибка при сохранении файла logSetting: {0}

# Logger_Critical_Critical_error
source: Critical error
de: Kritischer Fehler
es: Error crítico
fr: Erreur critique
it: Errore critico
pt_br: Erro crítico
ru: Критическая ошибка

# BooleanFieldAttribute_ValidValues_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

# BooleanFieldAttribute_ValidValues_No
source: No
de: Nein
fr: Non
pt_br: Não
ru: Нет

source: ToSapData should not be used on DateTimeFieldAttribute. Use the specialized handling for SAP date/time fields.
de: ToSapData sollte nicht auf DateTimeFieldAttributen verwendet werden. Verwenden Sie die spezialisierte Behandlung für SAP-Datums- und Zeitfelder.
es: ToSapData no debe utilizarse en DateTimeFieldAttribute. Utilice el manejo especializado para campos de fecha/hora para SAP.
fr: ToSapData ne doit pas être utilisé sur DateTimeFieldAttribute. Utilisez la gestion spécialisée pour les champs de date/heure SAP.
it: ToSapData non dovrebbe essere utilizzato su DateTimeFieldAttribute. Utilizzare la gestione specializzata per i campi data/ora SAP.
pt_br: ToSapData não deve ser usado em DateTimeFieldAttribute. Use a manipulação especializada para campos de data/hora SAP.
ru: ToSapData не должен использоваться на DateTimeFieldAttribute. Используйте специализированную обработку для полей даты/времени SAP.

source: ParseValue should not be used on DateTimeFieldAttribute. Use the specialized handling for SAP date/time fields.
de: ParseValue sollte nicht auf DateTimeFieldAttributen verwendet werden. Verwenden Sie die spezialisierte Behandlung für SAP-Datums- und Zeitfelder.
es: ParseValue no debe utilizarse en FechaTimeFieldAttribute. Utilice el manejo especializado para campos de fecha/hora para SAP.
fr: ParseValue ne doit pas être utilisé sur DateTimeFieldAttribute. Utilisez la gestion spécialisée pour les champs de date/heure SAP.
it: ParseValue non deve essere usato su DateTimeFieldAttribute. Usa la gestione specializzata per i campi data/ora di SAP.
pt_br: ParseValue não deve ser usado em DateTimeFieldAttribute. Use a manipulação especializada para campos de data/hora do SAP.
ru: ParseValue не должен использоваться на DateTimeFieldAttribute. Используйте специализированную обработку для SAP поля даты/времени.

source: Table Name cannot exceed 19 characters. Provided length: {0}.
de: Tabellenname darf 19 Zeichen nicht überschreiten. Die angegebene Länge: {0}.
es: El nombre de la tabla no puede exceder 19 caracteres. Longitud proporcionada: {0}.
fr: Le nom de la table ne doit pas dépasser 19 caractères. Longueur fournie : {0}.
it: Nome tabella non può superare i 19 caratteri. Lunghezza fornita: {0}.
pt_br: Nome da tabela não pode exceder 19 caracteres. Fornecimento: {0}.
ru: Имя таблицы не может превышать 19 символов. Указанная длина: {0}.

source: Table Description cannot exceed 30 characters. Provided length: {0}.
de: Tabellenbeschreibung darf 30 Zeichen nicht überschreiten. Angegebene Länge: {0}.
es: La descripción de la tabla no puede exceder los 30 caracteres. Longitud proporcionada: {0}.
fr: La description de la table ne doit pas dépasser 30 caractères. Longueur fournie : {0}.
it: La descrizione della tabella non può superare i 30 caratteri. Lunghezza fornita: {0}.
pt_br: A descrição da tabela não pode exceder 30 caracteres. Fornecimento: {0}.
ru: Описание таблицы не может превышать 30 символов. Предоставленная длина: {0}.

source: Name cannot exceed 50 characters. Provided length: {0}.
de: Der Name darf 50 Zeichen nicht überschreiten. Die angegebene Länge: {0}.
es: El nombre no puede exceder los 50 caracteres. Longitud proporcionada: {0}.
fr: Le nom ne peut pas dépasser 50 caractères. Longueur fournie : {0}.
it: Il nome non può superare i 50 caratteri. Lunghezza fornita: {0}.
pt_br: O nome não pode exceder 50 caracteres. Fornecimento de comprimento: {0}.
ru: Имя не может превышать 50 символов. Предоставленная длина: {0}.

source: Description cannot exceed 80 characters. Provided length: {0}.
de: Beschreibung kann 80 Zeichen nicht überschreiten. Bereitgestellte Länge: {0}.
es: La descripción no puede exceder los 80 caracteres. Longitud proporcionada: {0}.
fr: La description ne peut pas dépasser 80 caractères. Longueur fournie : {0}.
it: La descrizione non può superare 80 caratteri. Lunghezza fornita: {0}.
pt_br: Descrição não pode exceder 80 caracteres. Fornecimento de comprimento: {0}.
ru: Описание не может превышать 80 символов. Предоставленная длина: {0}.

source: The add-on has not been initialized,
de: Das Add-on wurde nicht initialisiert,
es: El add-on no ha sido inicializado,
fr: Le module n'a pas été initialisé,
it: L'add-on non è stato inizializzato,
pt_br: O complemento não foi inicializado,
ru: Дополнение не было инициализировано,

source: No Code was provided for new data in {0}, but PrimaryKeyStrategy was set to Manual.
de: Es wurde kein Code für neue Daten in {0}bereitgestellt, aber PrimaryKeyStrategy wurde auf Handbuch gesetzt.
es: No se proporcionó ningún código para nuevos datos en {0}, pero PrimaryKeyStrategy fue establecido en Manual.
fr: Aucun code n'a été fourni pour les nouvelles données dans {0}, mais PrimaryKeyStrategy a été réglé sur Manuel.
it: Non è stato fornito alcun codice per i nuovi dati in {0}, ma PrimaryKeyStrategy è stato impostato su Manuale.
pt_br: Nenhum código foi fornecido para novos dados em {0}, mas a PrimaryKeyStrategy foi definida como Manual.
ru: Новый код не был предоставлен для новых данных в {0}, но PrimaryKeyStrategy был установлен в Руководство.

source: Item with code {0} already exists in table {1}.
de: Artikel mit Code {0} existiert bereits in Tabelle {1}.
es: Artículo con código {0} ya existe en la tabla {1}.
fr: L'article avec le code {0} existe déjà dans la table {1}.
it: Oggetto con codice {0} esiste già nella tabella {1}.
pt_br: Item com código {0} já existe na tabela {1}.
ru: Товар с кодом {0} уже существует в таблице {1}.

source: {0} with code {1} does not exist in table {2}.
de: {0} mit Code {1} existiert nicht in der Tabelle {2}.
es: {0} con el código {1} no existe en la tabla {2}.
fr: {0} avec le code {1} n'existe pas dans la table {2}.
it: {0} con codice {1} non esiste nella tabella {2}.
pt_br: {0} com o código {1} não existe na tabela {2}.
ru: {0} с кодом {1} не существует в таблице {2}.

source: {0} is not decorated with UserTableAttribute.
de: {0} ist nicht mit UserTableAttribute verziert.
es: {0} no está decorado con UserTableAttribute.
fr: {0} n'est pas décoré avec UserTableAttribute.
it: {0} non è decorato con UserTableAttribute.
pt_br: {0} não está decorado com UserTableAttribute.
ru: {0} не украшен UserTableAttribute.

# ValidValuesExtension_AddRange_Could_not_add__0___1__to_ValidValues
source: Could not add `{0} - {1}` to ValidValues
de: Konnte `{0} - {1}` nicht zu ValidValues hinzufügen
es: No se pudo agregar `{0} - {1}` a Valores Validos
fr: Impossible d'ajouter `{0} - {1}` aux Valeurs valides
it: Impossibile aggiungere `{0} - {1}` a ValidValues
pt_br: Não foi possível adicionar `{0} - {1}` a Valores
ru: Не удалось добавить `{0} - {1}` в ValidValues

# ChangeTrackerMatrixForm_PreloadDataAsync_Preloading_data___
source: Preloading data...
de: Daten werden vorgeladen...
es: Precargando datos...
fr: Préchargement des données...
it: Ricarica dati...
pt_br: Pré-carregando dados...
ru: Загрузка данных...

# ChangeTrackerMatrixForm_PreloadDataAsync_PreloadData_Thread_Started
source: PreloadData Thread Started
de: Vorladedaten-Thread gestartet
es: Hilo de Precarga de datos iniciado
fr: Thread PreloadData démarré
it: Discussione PreloadData Iniziata
pt_br: Tópico de Pré-carregamento iniciado
ru: Запущена ветка PreloadData

# ChangeTrackerMatrixForm_PreloadDataAsync_PreloadData_Thread_Data_Loaded
source: PreloadData Thread Data Loaded
de: Vorladedaten Thread Daten geladen
es: Datos del hilo PreloadData cargados
fr: Données du sujet de préchargement chargées
it: Dati Conversazione PreloadData Caricato
pt_br: Dados de pré-carregamento da conversa carregados
ru: Предварительно загруженные данные в ветке загружены

# ChangeTrackerMatrixForm_AddContextMenuItems_Add_row
source: Add row
de: Zeile hinzufügen
es: Añadir fila
fr: Ajouter une ligne
it: Aggiungi riga
pt_br: Adicionar linha
ru: Добавить строку

# ChangeTrackerMatrixForm_AddContextMenuItems_Restore_row
source: Restore row
de: Zeile wiederherstellen
es: Restaurar fila
fr: Restaurer la ligne
it: Ripristina riga
pt_br: Restaurar linha
ru: Восстановить строку

# ChangeTrackerMatrixForm_AddContextMenuItems_Delete_row
source: Delete row
de: Zeile löschen
es: Eliminar fila
fr: Supprimer la ligne
it: Elimina riga
pt_br: Excluir linha
ru: Удалить строку

# ChangeTrackerMatrixForm_AddContextMenuItems_Error_adding_context_menu___0_
source: Error adding context menu: {0}
de: Fehler beim Hinzufügen des Kontextmenüs: {0}
es: Error al añadir menú contextual: {0}
fr: Erreur lors de l'ajout du menu contextuel : {0}
it: Errore nell'aggiungere il menu contestuale: {0}
pt_br: Erro ao adicionar menu de contexto: {0}
ru: Ошибка добавления контекстного меню: {0}

# ChangeTrackerMatrixForm_SaveChanges_Changes_could_not_be_saved_
source: Changes could not be saved.
de: Änderungen konnten nicht gespeichert werden.
es: No se han podido guardar los cambios.
fr: Les modifications n'ont pas pu être enregistrées.
it: Le modifiche non possono essere salvate.
pt_br: As alterações não puderam ser salvas.
ru: Изменения не могут быть сохранены.

source: {0} changes have been saved. {1} changes have failed.
de: {0} Änderungen wurden gespeichert. {1} Änderungen sind fehlgeschlagen.
es: {0} cambios han sido guardados. {1} cambios han fallado.
it: Le modifiche {0} sono state salvate. Le modifiche {1} sono fallite.
pt_br: Alterações {0} foram salvas. As alterações {1} falharam.
ru: {0} изменения были сохранены. {1} изменения не удались.

# ChangeTrackerMatrixForm_SaveChanges__0__changes_have_been_saved_
source: {0} changes have been saved.
de: {0} Änderungen wurden gespeichert.
es: Se han guardado {0} cambios.
it: Le modifiche {0} sono state salvate.
pt_br: Alterações {0} foram salvas.
ru: Изменений {0} сохранено.

# ChangeTrackerMatrixForm_Application_MenuEvent_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

# ChangeTrackerMatrixForm_Application_MenuEvent_Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Abandonner
it: Annulla
pt_br: cancelar
ru: Отмена

source: There are unsaved changes. Do you want to reload and discard the changes?
de: Es gibt ungespeicherte Änderungen. Möchten Sie die Änderungen neu laden und verwerfen?
es: Hay cambios sin guardar. ¿Desea recargar y descartar los cambios?
fr: Il y a des modifications non enregistrées. Voulez-vous recharger et annuler les modifications ?
it: Ci sono modifiche non salvate. Vuoi ricaricare e scartare le modifiche?
ru: Имеются несохраненные изменения. Вы хотите перезагрузить и отменить изменения?

# ChangeTrackerMatrixForm_SaveButtonOnClickAfter_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

# ChangeTrackerMatrixForm_SaveButtonOnClickAfter_No
source: No
de: Nein
fr: Non
pt_br: Não
ru: Нет

# ChangeTrackerMatrixForm_OnFormCloseBefore_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

# ChangeTrackerMatrixForm_OnFormCloseBefore_Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Abandonner
it: Annulla
pt_br: cancelar
ru: Отмена

# ChangeTrackerMatrixForm_ExportToExcel_Export_completed___0_
source: Export completed: {0}
de: Export abgeschlossen: {0}
es: Exportación completada: {0}
fr: Exportation terminée : {0}
it: Esportazione completata: {0}
pt_br: Exportação concluída: {0}
ru: Экспорт завершен: {0}

# ChangeTrackerMatrixForm_ExportToExcel_OK
source: OK
pt_br: Certo
ru: ОК

# ChangeTrackerMatrixForm_ExportToExcel_Open
source: Open
de: Öffnen
es: Abrir
fr: Ouvert
it: Apri
pt_br: Abertas
ru: Открыть

# ChangeTrackerMatrixForm_ExportToExcel_The_Excel_could_not_be_generated___0_
source: The Excel could not be generated: {0}
de: Das Excel konnte nicht generiert werden: {0}
es: El Excel no pudo ser generado: {0}
fr: L'Excel n'a pas pu être généré : {0}
it: Impossibile generare l'Excel: {0}
pt_br: O Excel não pôde ser gerado: {0}
ru: Эксел не может быть создан: {0}

# ChangeTrackerMatrixForm_ChooseSavePath_Save_Excel
source: Save Excel
de: Excel speichern
es: Guardar Excel
fr: Enregistrer Excel
it: Salva Excel
pt_br: Salvar Excel
ru: Сохранить Excel

# ChangeTrackerMatrixForm_ChooseSavePath_Excel_files__0_
source: Excel files {0}
de: Excel-Dateien {0}
es: Archivos Excel {0}
fr: Fichiers Excel {0}
it: File Excel {0}
pt_br: Arquivos do Excel {0}
ru: Excel файлы {0}

source: The number of decimal places must be between 0 and 6.
de: Die Anzahl der Dezimalstellen muss zwischen 0 und 6 liegen.
es: El número de decimales debe estar entre 0 y 6.
fr: Le nombre de décimales doit être compris entre 0 et 6.
it: Il numero di decimali deve essere compreso tra 0 e 6.
pt_br: O número de casas decimais deve estar entre 0 e 6.
ru: Количество знаков после запятой должно быть между 0 и 6.

# ChangeTrackerMatrixForm_GenerateExcel_No
source: No
de: Nein
fr: Non
pt_br: Não
ru: Нет

# ChangeTrackerMatrixForm_GenerateExcel_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

# ChangeTrackerMatrixForm_GenerateExcel_Invalid_value
source: Invalid value
de: Ungültiger Wert
es: Valor inválido
fr: Valeur non valide
it: Valore non valido
pt_br: Valor Inválido
ru: Неверное значение

# ChangeTrackerMatrixForm_GenerateExcel_Only_integers_are_allowed_
source: Only integers are allowed.
de: Nur ganze Zahlen sind erlaubt.
es: Sólo se permiten enteros.
fr: Seuls les entiers sont autorisés.
it: Sono ammessi solo interi.
pt_br: Apenas números inteiros são permitidos.
ru: Разрешены только целые числа.

# ChangeTrackerMatrixForm_GenerateExcel_Only_decimal_numbers_are_allowed_
source: Only decimal numbers are allowed.
de: Es sind nur Dezimalzahlen erlaubt.
es: Sólo se permiten números decimales.
fr: Seuls les nombres décimaux sont autorisés.
it: Sono ammessi solo numeri decimali.
pt_br: Somente números decimais são permitidos.
ru: Разрешены только десятичные числа.

# ChangeTrackerMatrixForm_GenerateExcel_Only_dates_are_allowed_
source: Only dates are allowed.
de: Nur Daten sind erlaubt.
es: Sólo se permiten fechas.
fr: Seules les dates sont autorisées.
it: Sono ammesse solo le date.
pt_br: Somente datas são permitidas.
ru: Разрешены только даты.

source: There are unsaved changes. Do you want to discard the changes?
de: Es gibt ungespeicherte Änderungen. Möchten Sie die Änderungen verwerfen?
es: Hay cambios sin guardar. ¿Desea descartar los cambios?
fr: Il y a des modifications non enregistrées. Voulez-vous annuler les modifications ?
it: Ci sono modifiche non salvate. Vuoi scartare le modifiche?
pt_br: Existem alterações não salvas. Você deseja descartar as alterações?
ru: Имеются несохраненные изменения. Вы хотите отменить изменения?

# ChangeTrackerMatrixForm_ImportFromExcel_Continue
source: Continue
de: Weiter
es: Continuar
fr: Continuer
it: Continua
pt_br: Continuar
ru: Продолжить

# ChangeTrackerMatrixForm_ImportFromExcel_Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Abandonner
it: Annulla
pt_br: cancelar
ru: Отмена

# ChangeTrackerMatrixForm_ImportFromExcel_Could_not_read_Excel___0_
source: Could not read Excel: {0}
de: Konnte Excel nicht lesen: {0}
es: No se pudo leer Excel: {0}
fr: Impossible de lire Excel : {0}
it: Impossibile leggere Excel: {0}
pt_br: Não foi possível ler o Excel: {0}
ru: Не удалось прочитать Excel: {0}

# ChangeTrackerMatrixForm_ChooseOpenPath_Import_Excel_file
source: Import Excel file
de: Excel-Datei importieren
es: Importar archivo Excel
fr: Importer un fichier Excel
it: Importa file Excel
pt_br: Importar arquivo Excel
ru: Импорт файла Excel

# ChangeTrackerMatrixForm_ChooseOpenPath_Excel_files__0_
source: Excel files {0}
de: Excel-Dateien {0}
es: Archivos Excel {0}
fr: Fichiers Excel {0}
it: File Excel {0}
pt_br: Arquivos do Excel {0}
ru: Excel файлы {0}

source: The file does not contain the sheet '{0}'. Please generate the Excel file using the export button.
de: Die Datei enthält nicht das Blatt '{0}'. Bitte erzeugen Sie die Excel-Datei über den Export-Button.
es: El archivo no contiene la hoja '{0}'. Por favor, genere el archivo Excel con el botón de exportar.
fr: Le fichier ne contient pas la feuille '{0}'. Veuillez générer le fichier Excel en utilisant le bouton d'exportation.
it: Il file non contiene il foglio '{0}'. Si prega di generare il file Excel utilizzando il pulsante di esportazione.
pt_br: O ficheiro não contém a folha '{0}'. Por favor, gere o ficheiro Excel utilizando o botão de exportação.
ru: Файл не содержит таблицы '{0}'. Пожалуйста, сгенерируйте файл Excel с помощью кнопки экспорта.

source: Invalid Excel file. Please generate the Excel file using the export button.
de: Ungültige Excel-Datei. Bitte erzeugen Sie die Excel-Datei mit dem Export-Button.
es: Archivo Excel no válido. Por favor, genere el archivo Excel con el botón de exportar.
fr: Fichier Excel invalide. Veuillez générer le fichier Excel en utilisant le bouton d'exportation.
it: File Excel non valido. Si prega di generare il file Excel utilizzando il pulsante di esportazione.
pt_br: Arquivo Excel inválido. Por favor, gere o arquivo Excel usando o botão de exportação.
ru: Недопустимый файл Excel. Пожалуйста, сгенерируйте файл Excel, используя кнопку экспорта.

source: Invalid Excel. Please generate the Excel file using the export button..
de: Ungültige Excel. Bitte erzeugen Sie die Excel-Datei mit dem Export-Button.
es: Excel inválido. Por favor, genere el archivo Excel con el botón de exportar...
fr: Excel invalide. Veuillez générer le fichier Excel en utilisant le bouton d'exportation..
it: Excel non valido. Si prega di generare il file Excel utilizzando il pulsante di esportazione..
pt_br: Excel. Gere um arquivo em Excel usando o botão de exportação..
ru: Неверный Excel. Пожалуйста, сгенерируйте файл Excel с помощью кнопки экспорта..

# ChangeTrackerMatrixForm_CustomInitializeComponent_Code
source: Code
es: Código
it: Codice
pt_br: Código
ru: Код

# ChangeTrackerMatrixForm_CustomInitializeComponent_Name
source: Name
es: Nombre
fr: Nom
it: Nome
pt_br: Nome:
ru: Наименование

# ObjectViewerForm_ObjectViewerForm_Add___New
source: Add & New
de: Neu
es: Añadir y Nuevo
fr: Ajouter & Nouveau
it: Aggiungi & Nuovo
pt_br: Adicionar e Novo
ru: Добавить и создать

# ObjectViewerForm_ObjectViewerForm_Add___View
source: Add & View
de: Hinzufügen & anzeigen
es: Añadir y ver
fr: Ajouter et afficher
it: Aggiungi & Vista
pt_br: Adicionar e Visualizar
ru: Добавить и просмотреть

# ObjectViewerForm_ObjectViewerForm_Add___Close
source: Add & Close
de: Hinzufügen & schließen
es: Añadir y cerrar
fr: Ajouter & Fermer
it: Aggiungi E Chiudi
pt_br: Adicionar e Fechar
ru: Добавить и закрыть

# ObjectViewerForm_ShowObjectSelector_Select_Object
source: Select Object
de: Objekt auswählen
es: Seleccionar objeto
fr: Sélectionner un objet
it: Seleziona Oggetto
pt_br: Selecionar objeto
ru: Выбрать объект

# ObjectViewerForm_ShowObjectSelector_Code
source: Code
es: Código
it: Codice
pt_br: Código
ru: Код

# ObjectViewerForm_ShowObjectSelector_Name
source: Name
es: Nombre
fr: Nom
it: Nome
pt_br: Nome:
ru: Наименование

# ObjectViewerForm_ShowObjectSelector_Select
source: Select
de: Auswählen
es: Seleccionar
fr: Sélectionner
it: Seleziona
pt_br: Selecionar
ru: Выбрать

# ObjectViewerForm_ShowObjectSelector_Cancel
source: Cancel
de: Abbrechen
es: Cancelar
fr: Abandonner
it: Annulla
pt_br: cancelar
ru: Отмена

# ObjectViewerForm_ShowObjectSelector_You_must_select_a_row_
source: You must select a row.
de: Sie müssen eine Zeile auswählen.
es: Debe seleccionar una fila.
fr: Vous devez sélectionner une ligne.
it: Devi selezionare una riga.
pt_br: Você deve selecionar uma linha.
ru: Необходимо выбрать строку.

# ObjectViewerForm_ShowObjectSelector_Error___0_
source: Error: {0}
de: Fehler: {0}
fr: Erreur: {0}
it: Errore: {0}
pt_br: Erro: {0}
ru: Ошибка: {0}

# ObjectViewerForm_AddButtonClickAfter_Yes
source: Yes
de: Ja
es: Sí
fr: Oui
it: Sì
pt_br: sim
ru: Да

source: You cannot change this document after you have added it. Continue?
de: Sie können dieses Dokument nicht ändern, nachdem Sie es hinzugefügt haben. Fortfahren?
es: Este documento no puede modificarse tras la creación. ¿Continuar?
fr: Vous ne pouvez pas modifier ce document après l'avoir ajouté. Continuer ?
it: Non puoi cambiare questo documento dopo averlo aggiunto. Continuare?
pt_br: Você não pode alterar este documento após adicioná-lo. Continuar?
ru: Вы не можете изменить этот документ после его добавления. Продолжить?

# ObjectViewerForm_AddButtonClickAfter_No
source: No
de: Nein
fr: Non
pt_br: Não
ru: Нет

# UserForm_UserForm_Starting_the_construction_of_the_UserForm
source: Starting the construction of the UserForm
de: Mit dem Bau des Benutzerformulars beginnen
es: Iniciando la construcción del UserForm
fr: Démarrage de la construction du formulaire utilisateur
it: Avviare la costruzione del modulo utente
pt_br: Iniciando a construção do Formulário de Usuário
ru: Запуск постройки пользовательской формы

# UserForm_UserForm_UserForm_successfully_initialized
source: UserForm successfully initialized
de: UserForm erfolgreich initialisiert
es: UserForm inicializado con éxito
fr: Le formulaire utilisateur a été initialisé avec succès
it: UserForm inizializzato con successo
pt_br: UserForm inicializado com sucesso
ru: Пользовательская форма успешно инициализирована

# UserForm_UserForm_Error_during_UserForm_initialization_
source: Error during UserForm initialization:
de: Fehler bei der Initialisierung des BenutzerFormulars:
es: Error durante la inicialización de UserForm:
fr: Erreur lors de l'initialisation du formulaire d'utilisateur :
it: Errore durante l'inizializzazione del modulo utente:
pt_br: Erro durante a inicialização Userform:
ru: Ошибка при инициализации формы пользователя:
