Repository: EricRamirezS/SAPUtils
Catalog: SAPUtils/__Internal/I18N/Texts.*.resx
Languages: de, es, fr, it, pt_br, ru

# SapUtils_GetReadableColumn_Primary_key_not_known_for_table___0___
source: Primary key not known for table '{0}'.
de: Primärer Schlüssel nicht bekannt für Tabelle '{0}'.
es: Clave primaria no conocida para la tabla '{0}'.
fr: Clé primaire non connue pour la table '{0}'.
it: Chiave primaria non nota per la tabella '{0}'.
pt_br: Chave primária não conhecida pela tabela '{0}'.
ru: Первичный ключ не известный для таблицы '{0}'.

# SapUtils_GetTableNameFromObjectType_Table_not_known_for_Object_Type____0___
source: Table not known for Object Type: '{0}'.
de: Tabelle nicht für Objekttyp bekannt: '{0}'.
es: La tabla no es conocida para el tipo de objeto: '{0}'.
fr: Table non connue pour le type d'objet : '{0}'.
it: Tabella non nota per il tipo di oggetto: '{0}'.
pt_br: Tabela não conhecida por Tipo de Objeto: '{0}'.
ru: Таблица не известна для типа объекта: '{0}'.

# SapAddon_Instance_SapAddon_instance_not_found
source: SapAddon instance not found
de: SapAddon-Instanz nicht gefunden
es: Instancia SapAddon no encontrada
fr: Instance SapAddon introuvable
it: Istanza SapAddon non trovata
pt_br: Instância SapAddon não encontrada
ru: Экземпляр SapAddon не найден

# ObjectViewerForm_AddButtonClickAfter_Invalid_option_
source: Invalid option.
de: Ungültige Option.
es: Opción inválida.
fr: Option non valide.
it: Opzione non valida.
pt_br: Opção inválida.
ru: Неверная опция.

# SapAddon_CreateMenu_Get_Menus_Object
source: Get Menus Object
es: Obtener objeto Menus

source: The changes will be saved. Do you want to continue?
de: Die Änderungen werden gespeichert. Möchten Sie fortfahren?
es: Los cambios se guardarán. ¿Desea continuar?
fr: Les modifications seront sauvegardées. Voulez-vous continuer ?
it: Le modifiche verranno salvate. Vuoi continuare?

source: There are unsaved changes. Do you want to save before closing?
de: Es gibt ungespeicherte Änderungen. Möchten Sie vor dem Schließen speichern?
es: Hay cambios sin guardar. ¿Desea guardar antes de cerrar?
fr: Il y a des modifications non enregistrées. Voulez-vous enregistrer avant de fermer ?
it: Ci sono modifiche non salvate. Salvare prima di chiudere?

# ChangeTrackerMatrixForm_CustomInitializeComponent__State_
source: [State]
es: [Acción]
