Repository: EricRamirezS/SAPUtils
Catalog: SAPUtils/__Internal/I18N/Texts.*.resx
Languages: de, es, fr, it, pt_br, ru

# UserForm_LoadForm_Starting_form_loading
source: Starting form loading
de: Laden des Formulars starten
es: Iniciando la carga del formulario
fr: Démarrage du chargement du formulaire
it: Caricamento del modulo iniziale
pt_br: Iniciando o carregamento do formulário
ru: Загрузка формы

# UserForm_LoadForm_Loading_form_file_from___0_
source: Loading form file from: {0}
de: Formulardatei wird geladen von: {0}
es: Cargando archivo de formulario de: {0}
fr: Chargement du formulaire depuis : {0}
it: Caricamento file modulo da: {0}
pt_br: Carregando arquivo do formulário de: {0}
ru: Загрузка файла формы из: {0}

# UserForm_LoadForm_Form_node_not_found_in_XML_file
source: Form node not found in XML file
de: Formularknoten nicht in XML-Datei gefunden
es: Nodo Form no encontrado en archivo XML
fr: Nœud de formulaire introuvable dans le fichier XML
it: Nodo modulo non trovato nel file XML
pt_br: Servidor de formulário não encontrado no arquivo XML
ru: Узел формы не найден в XML-файле

# UserForm_LoadForm_Form_is_not_valid
source: Form is not valid
de: Formular ist ungültig
es: El formulario no es válido
fr: Le formulaire n'est pas valide
it: Il modulo non è valido
pt_br: Formulário não é válido
ru: Форма не является допустимой

# UserForm_LoadForm_Form_node_has_no_attributes
source: Form node has no attributes
de: Formularknoten hat keine Attribute
es: El nodo Form no tiene atributos
fr: Le nœud de formulaire n'a aucun attribut
it: Il nodo del modulo non ha attributi
pt_br: O nó de formulário não possui atributos
ru: Узел формы не имеет атрибутов

# UserForm_LoadForm_Form_type_set_to___0_
source: Form type set to: {0}
de: Formulartyp gesetzt auf: {0}
es: Tipo de formulario establecido a: {0}
fr: Type de formulaire défini à : {0}
it: Tipo di modulo impostato a: {0}
pt_br: Tipo de formulário definido como: {0}
ru: Тип формы установлен: {0}

# UserForm_LoadForm_Closing_existing_form_with_UID___0_
source: Closing existing form with UID: {0}
de: Bestehendes Formular mit UID schließen: {0}
es: Cerrando formulario existente con UID: {0}
fr: Fermeture du formulaire existant avec UID : {0}
it: Chiusura modulo esistente con UID: {0}
pt_br: Fechando o formulário existente com UID: {0}
ru: Закрытие существующей формы с UID: {0}

# UserForm_LoadForm_Could_not_close_form__0_
source: Could not close form {0}
de: Formular {0} konnte nicht geschlossen werden
es: No se pudo cerrar el formulario {0}
fr: Impossible de fermer le formulaire {0}
it: Impossibile chiudere il modulo {0}
pt_br: Não foi possível fechar o formulário {0}
ru: Не удалось закрыть форму {0}

# UserForm_LoadForm_Loading_batch_actions_into_application
source: Loading batch actions into application
de: Laden von Batch-Aktionen in die Anwendung
es: Cargando acciones por lotes en la aplicación
fr: Chargement des actions en lots dans l'application
it: Caricamento azioni batch in applicazione
pt_br: Carregando ações em lote na aplicação
ru: Загрузка пакетных действий в приложение

# UserForm_LoadForm_Form_loaded_successfully
source: Form loaded successfully
de: Formular erfolgreich geladen
es: Formulario cargado correctamente
fr: Formulaire chargé avec succès
it: Modulo caricato con successo
pt_br: Formulário carregado com sucesso
ru: Форма успешно загружена

# UserForm_LoadForm_Error_during_form_loading__
source: Error during form loading:
de: Fehler beim Laden des Formulars:
es: Error durante la carga del formulario:
fr: Erreur lors du chargement du formulaire:
it: Errore durante il caricamento del modulo:
pt_br: Erro durante o carregamento do formulário:
ru: Ошибка при загрузке формы:

# UserForm_Show_Attempting_to_show_form
source: Attempting to show form
de: Versuch Formular anzuzeigen
es: Intentando mostrar formulario
fr: Tentative d'afficher le formulaire
it: Tentativo di mostrare il modulo
pt_br: Tentando mostrar o formulário
ru: Попытка показать форму

# UserForm_Show_Cannot_show_form_because_it_is_not_alive
source: Cannot show form because it is not alive
de: Formular kann nicht angezeigt werden, da es nicht am Leben ist
es: No se puede mostrar el formulario porque no está vivo
fr: Impossible d'afficher le formulaire car il n'est pas en vie
it: Impossibile mostrare il modulo perché non è vivo
pt_br: Não é possível mostrar o formulário porque ele não está vivo
ru: Не удается показать форму, потому что она не жива

# UserForm_Show_Form_displayed_successfully
source: Form displayed successfully
de: Formular erfolgreich angezeigt
es: Formulario mostrado con éxito
fr: Formulaire affiché avec succès
it: Modulo visualizzato con successo
pt_br: Formulário exibido com sucesso
ru: Форма успешно показана

# UserForm_ShowWaitCursor_Loading___
source: Loading...
de: Wird geladen...
es: Cargando...
fr: Chargement en cours...
it: Caricamento...
pt_br: Carregandochar@@0
ru: Загрузка...

# UserForm_Select_Selecting_form_with_UID___0_
source: Selecting form with UID: {0}
de: Formular mit UID auswählen: {0}
es: Seleccionando formulario con UID: {0}
fr: Sélection du formulaire avec UID : {0}
it: Selezione modulo con UID: {0}
pt_br: Selecionando formulário com UID: {0}
ru: Выбор формы с UID: {0}

# UserForm_Close_Closing_form_with_UID___0_
source: Closing form with UID: {0}
de: Formular mit UID schließen: {0}
es: Cerrando formulario con UID: {0}
fr: Fermeture du formulaire avec UID : {0}
it: Modulo di chiusura con UID: {0}
pt_br: Fechando formulário com UID: {0}
ru: Закрытие формы с UID: {0}

# UserForm_Refresh_Refreshing_form_with_UID___0_
source: Refreshing form with UID: {0}
de: Aktualisiere Formular mit UID: {0}
es: Refrescando formulario con UID: {0}
fr: Actualisation du formulaire avec UID : {0}
it: Aggiornamento modulo con UID: {0}
pt_br: Atualizando formulário com UID: {0}
ru: Обновление формы с UID: {0}

# UserForm_GetAsXML_Getting_XML_representation_of_form_with_UID___0_
source: Getting XML representation of form with UID: {0}
de: Abrufen der XML-Darstellung des Formulars mit UID: {0}
es: Obteniendo representación XML del formulario con UID: {0}
fr: Récupération de la représentation XML du formulaire avec UID : {0}
it: Ottenere la rappresentazione XML del modulo con UID: {0}
pt_br: Obtendo representação XML do formulário com UID: {0}
ru: Получение XML представления формы с UID: {0}

# UserForm_Update_Updating_form_with_UID___0_
source: Updating form with UID: {0}
de: Aktualisiere Formular mit UID: {0}
es: Actualizando formulario con UID: {0}
fr: Mise à jour du formulaire avec UID : {0}
it: Aggiornamento modulo con UID: {0}
pt_br: Atualizando formulário com UID: {0}
ru: Обновление формы с UID: {0}

# UserForm_Update_Form_updated_successfully
source: Form updated successfully
de: Formular erfolgreich aktualisiert
es: Formulario actualizado correctamente
fr: Formulaire mis à jour avec succès
it: Modulo aggiornato con successo
pt_br: Formulário atualizado com sucesso
ru: Форма успешно обновлена

# UserForm_Update_Error_updating_form___0_
source: Error updating form: {0}
de: Fehler beim Aktualisieren des Formulars: {0}
es: Error actualizando formulario: {0}
fr: Erreur lors de la mise à jour du formulaire : {0}
it: Errore nell'aggiornare il modulo: {0}
pt_br: Erro ao atualizar formulário: {0}
ru: Ошибка обновления формы: {0}

# UserForm_Freeze_Setting_form_freeze_state_to__0__for_form_with_UID___1_
source: Setting form freeze state to {0} for form with UID: {1}
de: Setze Formular Einfrierstatus auf {0} für Formular mit UID: {1}
es: Establecer estado de congelación de formulario a {0} para formulario con UID: {1}
fr: Réglage de l'état de blocage du formulaire à {0} pour le formulaire avec UID : {1}
it: Impostazione dello stato di congelamento del modulo a {0} per il modulo con UID: {1}
pt_br: Definindo o estado de congelamento do formulário para {0} para o formulário com UID: {1}
ru: Установка состояния замораживания форм на {0} для формы с UID: {1}

# UserForm_EnableMenu_Setting_menu__0__enabled_state_to__1__for_form_with_UID___2_
source: Setting menu {0} enabled state to {1} for form with UID: {2}
de: Setze Menü {0} aktivierten Status auf {1} für Formular mit UID: {2}
es: Ajustando el estado de habilitado del menú {0} a {1} para el formulario con UID: {2}
fr: Réglage du menu {0} état activé à {1} pour le formulaire avec UID : {2}
it: Impostazione del menu {0} ha abilitato lo stato a {1} per il modulo con UID: {2}
pt_br: A configuração do menu {0} ativou o estado para {1} para o formulário com UID: {2}
ru: Установка меню {0} включено в {1} для формы с UID: {2}

# UserForm_ResetMenuStatus_Resetting_menu_status_for_form_with_UID___0_
source: Resetting menu status for form with UID: {0}
de: Menüstatus für Formular mit UID zurücksetzen: {0}
es: Restableciendo el estado del menú del formulario con UID: {0}
fr: Réinitialisation du statut du menu pour le formulaire avec UID : {0}
it: Ripristino dello stato del menu per il modulo con UID: {0}
pt_br: Redefinindo o status do menu para o formulário com UID: {0}
ru: Сброс статуса меню для формы с UID: {0}

# UserForm_Resize_Resizing_form_to_Width___0___Height___1_
source: Resizing form to Width: {0}, Height: {1}
de: Größe des Formulars auf Breite: {0}, Höhe: {1}
es: Redimensionando formulario a Ancho: {0}, Altura: {1}
fr: Redimensionnement du formulaire à la largeur : {0}, Hauteur : {1}
it: Ridimensionamento del modulo alla larghezza: {0}, Altezza: {1}
pt_br: Redimensionando o formulário para largura: {0}, Altura: {1}
ru: Форма изменения до ширины: {0}, Высота: {1}

# UserForm_EnableFormatSearch_Enabling_format_search_for_form_with_UID___0_
source: Enabling format search for form with UID: {0}
de: Aktiviere Formatsuche für Formular mit UID: {0}
es: Habilitando la búsqueda en formato del formulario con UID: {0}
fr: Activation de la recherche de format pour le formulaire avec UID : {0}
it: Abilitare la ricerca di formato per il modulo con UID: {0}
pt_br: Ativando busca de formato para o formulário com UID: {0}
ru: Включение поиска формата для формы с UID: {0}

# UserTableObjectModel_GetAll_Fetching_All__0_
source: Fetching All {0}
de: Rufe alle {0} ab
es: Obteniendo todos los {0}
fr: Récupération de tous les {0}
it: Recupero Di Tutto {0}
pt_br: Buscando Todos {0}
ru: Получение всего {0}

# UserTableObjectModel_GetAll_UserTableAttribute_not_found_in__0_
source: UserTableAttribute not found in {0}
de: UserTableAttribut nicht gefunden in {0}
es: UserTableAttribute no se encontró en {0}
fr: UserTableAttribute introuvable dans {0}
it: UserTableAttribute non trovato in {0}
pt_br: Não encontrado {0}
ru: UserTableАтрибут не найден в {0}

# UserTableObjectModel_GetAll_Fetching_all__0__from_table__1_
source: Fetching all {0} from table {1}
de: Lade alle {0} aus Tabelle {1}
es: Obteniendo todos los {0} de la tabla {1}
fr: Récupération de tous les {0} de la table {1}
it: Recupero di tutti {0} dalla tabella {1}
pt_br: Obtendo todos os {0} da tabela {1}
ru: Получение всего {0} из таблицы {1}

# UserTableObjectModel_GetAll_Executing_query___0_
source: Executing query: {0}
de: Abfrage wird ausgeführt: {0}
es: Ejecutando consulta: {0}
fr: Exécution de la requête : {0}
it: Esecuzione della domanda: {0}
pt_br: Executando consulta: {0}
ru: Выполнение запроса: {0}

# UserTableObjectModel_PopulateFields_Processing_field___0___1_
source: Processing field: {0}.{1}
de: Verarbeite Feld: {0}.{1}
es: Procesando campo: {0}.{1}
fr: Champ de traitement : {0}.{1}
it: Campo di elaborazione: {0}.{1}
pt_br: Processando campo: {0}.{1}
ru: Обработка поля: {0}.{1}

# UserTableObjectModel_PopulateFields_
source: Processing field: {0}.{1} = {2}
de: Verarbeite Feld: {0}.{1} = {2}
es: Procesando campo: {0}.{1} = {2}
fr: Champ de traitement : {0}.{1} = {2}
it: Campo di elaborazione: {0}.{1} = {2}
pt_br: Processando campo: {0}.{1} = {2}
ru: Обработка поля: {0}.{1} = {2}

# UserTableObjectModel_Get_Fetching__0__with_Code___1_
source: Fetching {0} with Code: {1}
de: Abrufen von {0} mit Code: {1}
es: Obteniendo {0} con código: {1}
fr: Récupération de {0} avec le code : {1}
it: Recupero {0} con il Codice: {1}
pt_br: Buscando {0} com Código: {1}
ru: Получение {0} с кодом: {1}

# UserTableObjectModel_Get_UserTableAttribute_not_found_in__0_
source: UserTableAttribute not found in {0}
de: UserTableAttribut nicht gefunden in {0}
es: Atributo UserTableAttribute no encontrado en {0}
fr: UserTableAttribute introuvable dans {0}
it: UserTableAttribute non trovato in {0}
pt_br: Não encontrado {0}
ru: UserTableАтрибут не найден в {0}

# UserTableObjectModel_Get_Fetching__0__from_table__1__with_Code___2_
source: Fetching {0} from table {1} with Code: {2}
de: Abrufen von {0} aus Tabelle {1} mit Code: {2}
es: Obteniendo {0} de la tabla {1} con código: {2}
fr: Récupération de {0} à partir de la table {1} avec le code : {2}
it: Recupero {0} dalla tabella {1} con Codice: {2}
pt_br: Buscando {0} da tabela {1} com código: {2}
ru: Получение {0} из таблицы {1} с кодом: {2}

# UserTableObjectModel_Get__0__from_table__1__not_found_with_Code___2_
source: {0} from table {1} not found with Code: {2}
de: {0} aus Tabelle {1} nicht gefunden mit Code: {2}
es: {0} de la tabla {1} con el código: {2} no se encuentra.
fr: {0} de la table {1} non trouvé avec le code : {2}
it: {0} dalla tabella {1} non trovato con il Codice: {2}
pt_br: {0} da tabela {1} não encontrado com código: {2}
ru: {0} из таблицы {1} не найдено с кодом: {2}

source: {0} from table {1} found in {0}, populating properties...
de: {0} aus Tabelle {1} gefunden in {0}, füllte Eigenschaften...
es: {0} de la tabla {1} encontrada en {0}, poblando propiedades...
fr: {0} de la table {1} trouvée dans {0}, remplissant les propriétés...
it: {0} dalla tabella {1} trovata in {0}, popolando proprietà...
pt_br: {0} da tabela {1} encontrada em {0}, preenchendo propriedades...
ru: {0} из таблицы {1} найдено в {0}, заполняющие свойства...

# UserTableObjectModel_Get__0__successfully_populated_for_Code___1_
source: {0} successfully populated for Code: {1}
de: {0} erfolgreich für Code: {1}
es: {0} poblado con éxito para el código: {1}
fr: {0} a réussi à remplir le code : {1}
it: {0} popolato con successo per il Codice: {1}
pt_br: {0} preenchido com sucesso para o código: {1}
ru: {0} успешно заполнил код: {1}

# UserTableObjectModel_UserTableObjectModel_Initializing_UserTableObjectModel___
source: Initializing UserTableObjectModel...
de: Initialisiere UserTableObjectModel...
es: Inicializando UserTableObjectModel...
fr: Initialisation de UserTableObjectModel...
it: Inizializzazione UserTableObjectModel...
pt_br: Inicializando UserTableObjectModel...
ru: Инициализация UserTableObjectModel...

# UserTableObjectModel_UserTableObjectModel_UserTableAttribute_initialized___0_
source: UserTableAttribute initialized: {0}
de: UserTableAttribut initialisiert: {0}
es: Atributo UserTableAttribute inicializado: {0}
fr: Attribut utilisateur initialisé : {0}
it: UserTableAttribute inizializzato: {0}
pt_br: Atributo inicializado: {0}
ru: Атрибут UserTableАтрибут: {0}

# UserTableObjectModel_Add_Attempting_to_add__0__into_table__1__with_Code___2_
source: Attempting to add {0} into table {1} with Code: {2}
de: Versuche {0} in Tabelle {1} mit Code hinzuzufügen: {2}
es: Intentando añadir {0} a la tabla {1} con código: {2}
fr: Tentative d’ajouter {0} à la table {1} avec le code {2}
it: Tentativo di aggiungere {0} alla tabella {1} con Codice: {2}
pt_br: Tentativa de adicionar {0} na tabela {1} com Código: {2}
ru: Попытка добавить {0} в таблицу {1} с кодом: {2}

# UserTableObjectModel_Update_Attempting_to_update__0__in_table__1__with_Code___2_
source: Attempting to update {0} in table {1} with Code: {2}
de: Versuch {0} in Tabelle {1} mit Code zu aktualisieren: {2}
es: Intentando actualizar {0} en la tabla {1} con código: {2}
fr: Tentative de mise à jour de {0} dans la table {1} avec le code {2}
it: Tentativo di aggiornare {0} nella tabella {1} con Codice: {2}
pt_br: Tentando atualizar {0} na tabela {1} com Código: {2}
ru: Попытка обновить {0} в таблице {1} с кодом: {2}

# UserTableObjectModel_Update_Retrieving_SAP_User_Table___0_____
source: Retrieving SAP User Table '{0}'...
de: SAP-Benutzertabelle '{0}'...
es: Recuperando tabla de usuario SAP '{0}'...
fr: Récupération de la table utilisateur SAP '{0}'...
it: Recupero Tabella Utente SAP '{0}'...
pt_br: Recuperando a Tabela de Usuário do SAP '{0}'...
ru: Получение таблицы пользователей SAP '{0}'...

source: Attempting to delete {0} from table {1} with Code: {2}
de: Versuche {0} aus Tabelle {1} mit Code zu löschen: {2}
es: Intentando eliminar {0} de la tabla {1} con código: {2}
fr: Tentative de suppression de {0} de la table {1} avec le code {2}
it: Tentativo di eliminare {0} dalla tabella {1} con Codice: {2}
pt_br: Tentativa de excluir {0} da tabela {1} com o código: {2}
ru: Попытка удалить {0} из таблицы {1} с кодом: {2}

# UserTableObjectModel_Delete__0__from_table__1__with_Code__2__does_not_exist_
source: {0} from table {1} with Code {2} does not exist.
de: {0} aus Tabelle {1} mit Code {2} existiert nicht.
es: {0} de la tabla {1} con código {2} no existe.
it: {0} dalla tabella {1} con il codice {2} non esiste.
pt_br: {0} da tabela {1} com código {2} não existe.
ru: {0} из таблицы {1} с кодом {2} не существует.

source: {0} from table {1} with Code {3} deleted successfully.
de: {0} aus Tabelle {1} mit Code {3} erfolgreich gelöscht.
es: {0} de la tabla {1} con código {3} eliminado correctamente.
fr: {0} de la table {1} avec le code {3} supprimé avec succès.
it: {0} dalla tabella {1} con codice {3} eliminato con successo.
pt_br: {0} da tabela {1} com código {3} excluído com sucesso.
ru: {0} из таблицы {1} с кодом {3} успешно удален.

source: Failed to delete {0} from table {1} with Code {2}. SAP Error Code: {3}. SAP Error Message: {4}
de: Fehler beim Löschen von {0} aus der Tabelle {1} mit Code {2}. SAP-Fehlercode: {3}. SAP-Fehlermeldung: {4}
es: Error al eliminar {0} de la tabla {1} con código {2}. Código de error SAP: {3}. Mensaje de error SAP: {4}
fr: Impossible de supprimer {0} de la table {1} avec le code {2}. Code d'erreur SAP : {3}. Message d'erreur SAP : {4}
it: Impossibile eliminare {0} dalla tabella {1} con codice {2}. Codice di errore SAP: {3}. Messaggio di errore SAP: {4}
pt_br: Falha ao excluir {0} da tabela {1} com código {2}. Código de erro SAP: {3}. Mensagem de erro SAP: {4}
ru: Не удалось удалить {0} из таблицы {1} с кодом {2}. Код ошибки SAP : {3}. Сообщение об ошибке SAP : {4}

# UserTableObjectModel_Save_Validating__0__s_field__1_____2_
source: Validating {0}'s field {1} = {2}
de: Validierung des Feldes {0} {1} = {2}
es: Validando el campo {0} de {1} = {2}
fr: Validation du champ {0}d' {1} = {2}
it: Convalida del campo {0} {1} = {2}
pt_br: Validando o campo {0} {1} = {2}
ru: Проверка поля {0} {1} = {2}

# UserTableObjectModel_Save_Invalid_value_for_field__0____1_
source: Invalid value for field {0}: {1}
de: Ungültiger Wert für Feld {0}: {1}
es: Valor no válido para el campo {0}: {1}
fr: Valeur invalide pour le champ {0}: {1}
it: Valore non valido per il campo {0}: {1}
pt_br: Valor inválido para o campo {0}: {1}
ru: Недопустимое значение для поля {0}: {1}

# UserTableObjectModel_Save_Saving__0__into_table__1__with_Code___2_
source: Saving {0} into table {1} with Code: {2}
de: Speichere {0} in Tabelle {1} mit Code: {2}
es: Guardando {0} en la tabla {1} con código: {2}
fr: Enregistrement de {0} dans la table {1} avec le code : {2}
it: Salvataggio di {0} nella tabella {1} con Codice: {2}
pt_br: Salvando {0} na tabela {1} com código: {2}
ru: Сохранение {0} в таблицу {1} с кодом: {2}

# UserTableObjectModel_Save_Updating_existing__0__in_table__1__with_Code___2_
source: Updating existing {0} in table {1} with Code: {2}
de: Aktualisiere vorhandene {0} in Tabelle {1} mit Code: {2}
es: Actualizando el {0} existente en la tabla {1} con el código: {2}
fr: Mise à jour de l' {0} existant dans la table {1} avec le code : {2}
it: Aggiornamento {0} esistente nella tabella {1} con Codice: {2}
pt_br: Atualizando o {0} existente na tabela {1} com Código: {2}
ru: Обновление существующих {0} в таблице {1} с кодом: {2}

# UserTableObjectModel_Save_Inserting_new__0__into_table__1__with_Code___2_
source: Inserting new {0} into table {1} with Code: {2}
de: Füge neue {0} in Tabelle {1} mit Code ein: {2}
es: Insertando nuevo {0} en la tabla {1} con código: {2}
fr: Insertion d'un nouvel {0} dans la table {1} avec le code {2}
it: Inserimento del nuovo {0} nella tabella {1} con Codice: {2}
pt_br: Inserindo novo {0} na tabela {1} com código: {2}
ru: Вставка новой {0} в таблицу {1} с кодом: {2}

# UserTableObjectModel_Save_Failed_to_assign_value_to_field__0____1_
source: Failed to assign value to field {0}: {1}
de: Fehler beim Zuweisen des Wertes zu Feld {0}: {1}
es: Error al asignar el valor al campo {0}: {1}
fr: Impossible d'attribuer la valeur au champ {0}: {1}
it: Assegnazione del valore al campo {0}non riuscita: {1}
pt_br: Falha ao atribuir o valor para o campo {0}: {1}
ru: Не удалось назначить значение для поля {0}: {1}

# UserTableObjectModel_Save_Processed_field__0_____1_
source: Processed field {0} = {1}
de: Verarbeitetes Feld {0} = {1}
es: Campo procesado {0} = {1}
fr: Champ traité {0} = {1}
it: Campo Elaborato {0} = {1}
pt_br: Campo processado {0} = {1}
ru: Обработано поле {0} = {1}

# UserTableObjectModel_Save__0__from_table__1__with_Code__2__saved_successfully_
source: {0} from table {1} with Code {2} saved successfully.
de: {0} aus der Tabelle {1} mit Code {2} erfolgreich gespeichert.
es: {0} de la tabla {1} con código {2} guardado con éxito.
fr: {0} de la table {1} avec le code {2} enregistré avec succès.
it: {0} dalla tabella {1} con codice {2} salvato con successo.
pt_br: {0} da tabela {1} com código {2} salvo com sucesso.
ru: {0} из таблицы {1} с кодом {2} успешно сохранен.

source: Failed to save {0} in table {1} with Code {2}. SAP Error Code: {3}. SAP Error Message: {4}
de: Fehler beim Speichern von {0} in Tabelle {1} mit Code {2}. SAP-Fehlercode: {3}. SAP-Fehlermeldung: {4}
es: No se pudo guardar {0} en la tabla {1} con código {2}. Código de error SAP: {3}. Mensaje de error SAP: {4}
fr: Impossible d'enregistrer {0} dans la table {1} avec le code {2}. Code d'erreur SAP : {3}. Message d'erreur SAP : {4}
it: Fallito il salvataggio di {0} nella tabella {1} con codice {2}. Codice di errore PAS: {3}. Messaggio di errore PAS: {4}
pt_br: Falha ao salvar {0} na tabela {1} com código {2}. Código de erro SAP: {3}. Mensagem de erro SAP: {4}
ru: Не удалось сохранить {0} в таблице {1} с кодом {2}. Код ошибки SAP : {3}. Сообщение об ошибке SAP : {4}

# UserTableObjectModel_RestoreOriginalCode_Reverting__0__Code_to___1_
source: Reverting {0} Code to: {1}
de: {0} Code zurücksetzen: {1}
es: Revertir código {0} a: {1}
fr: Rétablissement du code {0} à : {1}
it: Ripristino codice {0} a: {1}
pt_br: Revertendo o Código {0} para: {1}
ru: Восстановление {0} кода: {1}

# FormUtils_ValidateTimeCell_Invalid_time_value__ODBC_1031___131_183_
source: Invalid time value (ODBC-1031) [131-183]
de: Ungültiger Zeitwert (ODBC-1031) [131-183]
es: Valor temporal inválido (ODBC-1031) [131-183]
fr: Valeur de temps invalide (ODBC-1031) [131-183]
it: Valore orario non valido (ODBC-1031) [131-183]
pt_br: Valor de tempo inválido (ODBC-1031) [131-183]
ru: Недопустимое значение времени (ODBC-1031) [131-183]

# ColumnParser_FormatDtValue_Unknown_Parsing
source: Unknown Parsing
de: Unbekanntes Parsen
es: Conversión desconocida
fr: Analyse inconnue
it: Analisi Sconosciuta
pt_br: Análise desconhecida
ru: Неизвестный парсинг

# SapUtils_GetPrimaryKey_Primary_key_not_known_for_table___0___
source: Primary key not known for table '{0}'.
de: Primärer Schlüssel nicht bekannt für Tabelle '{0}'.
es: Clave primaria no conocida para la tabla '{0}'.
fr: Clé primaire non connue pour la table '{0}'.
it: Chiave primaria non nota per la tabella '{0}'.
pt_br: Chave primária não conhecida pela tabela '{0}'.
ru: Первичный ключ не известный для таблицы '{0}'.
